Adam-neeeds-help/Flipper-Zero-ESP32-Port-1/components/furi_hal/furi_hal_power.c
#include "furi_hal_power.h"
#include "furi_hal_bq27220.h"
#include "furi_hal_bq25896.h"
#include "furi_hal_display.h"
#include "boards/board.h"

#include <math.h>
#include <stdio.h>

#include <esp_adc/adc_cali.h>
#include <esp_adc/adc_cali_scheme.h>
#include <esp_adc/adc_oneshot.h>
#include <esp_err.h>
#include <esp_log.h>
#include <esp_sleep.h>
#if CONFIG_PM_ENABLE
#include <esp_pm.h>
#endif
#include <soc/soc_caps.h>
#include <driver/i2c.h>
#include <esp_system.h>
#include <esp_timer.h>
#include <driver/gpio.h>

#include <freertos/FreeRTOS.h>
#include <freertos/task.h>

#include <furi.h>

#include "furi_hal_resources.h"

#define TAG "FuriHalPower"

#if CONFIG_PM_ENABLE
/* Held whenever insomnia > 0. Pins the CPU at max frequency so timing-critical
 * sections (bracketed with furi_hal_power_insomnia_enter/exit, e.g. every SPI
 * transaction) are not slowed by dynamic frequency scaling. NULL if the lock
 * could not be created, in which case insomnia becomes a no-op for DFS. */
static esp_pm_lock_handle_t furi_hal_power_freq_lock = NULL;
#endif

#define FURI_HAL_POWER_USB_PRESENT_THRESHOLD_V  (4.6f)
#define FURI_HAL_POWER_LOW_BATTERY_THRESHOLD_V  (3.35f)
#define FURI_HAL_POWER_EMPTY_BATTERY_VOLTAGE_V  (3.27f)
#define FURI_HAL_POWER_FULL_BATTERY_VOLTAGE_V   (4.20f)
#define FURI_HAL_POWER_ADC_DIVIDER_RATIO        (3.0f)
#define FURI_HAL_POWER_SAMPLE_REFRESH_US        (250000LL)
#define FURI_HAL_POWER_CHARGE_LIMIT_MIN_V       (3.840f)
#define FURI_HAL_POWER_CHARGE_LIMIT_MAX_V       (4.208f)
#define FURI_HAL_POWER_CHARGE_LIMIT_STEP_V      (0.016f)

typedef struct {
    bool initialized;
    bool init_attempted;
    bool adc_ready;
    bool adc_cali_ready;
    bool last_sample_ok;
    bool otg_enabled;
    bool has_battery_reading;
    uint8_t insomnia;
    uint8_t suppress_charge;
    int64_t last_sample_us;
    float charge_voltage_limit;
    float last_supply_voltage;
    float last_battery_voltage;
    adc_unit_t adc_unit;
    adc_channel_t adc_channel;
    adc_oneshot_unit_handle_t adc_handle;
    adc_cali_handle_t adc_cali_handle;
} FuriHalPowerState;

typedef struct {
    float voltage;
    uint8_t pct;
} FuriHalPowerCurvePoint;

static FuriHalPowerState furi_hal_power = {
    .initialized = false,
    .init_attempted = false,
    .adc_ready = false,
    .adc_cali_ready = false,
    .last_sample_ok = false,
    .otg_enabled = false,
    .has_battery_reading = false,
    .insomnia = 0,
    .suppress_charge = 0,
    .last_sample_us = 0,
    .charge_voltage_limit = FURI_HAL_POWER_FULL_BATTERY_VOLTAGE_V,
    .last_supply_voltage = 0.0f,
    .last_battery_voltage = FURI_HAL_POWER_FULL_BATTERY_VOLTAGE_V,
};

static const FuriHalPowerCurvePoint furi_hal_power_curve[] = {
    {3.27f, 0},
    {3.61f, 5},
    {3.69f, 10},
    {3.71f, 20},
    {3.73f, 30},
    {3.75f, 40},
    {3.77f, 50},
    {3.79f, 60},
    {3.82f, 70},
    {3.87f, 80},
    {3.94f, 90},
    {4.20f, 100},
};

static bool furi_hal_power_adc_calibration_init(
    adc_unit_t unit,
    adc_channel_t channel,
    adc_atten_t atten,
    adc_cali_handle_t* out_handle) {
#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    adc_cali_curve_fitting_config_t cali_config = {
        .unit_id = unit,
        .chan = channel,
        .atten = atten,
        .bitwidth = ADC_BITWIDTH_DEFAULT,
    };
    if(adc_cali_create_scheme_curve_fitting(&cali_config, out_handle) == ESP_OK) {
        return true;
    }
#endif
#if ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
    adc_cali_line_fitting_config_t cali_config = {
        .unit_id = unit,
        .atten = atten,
        .bitwidth = ADC_BITWIDTH_DEFAULT,
    };
    if(adc_cali_create_scheme_line_fitting(&cali_config, out_handle) == ESP_OK) {
        return true;
    }
#endif
    return false;
}

static float furi_hal_power_quantize_charge_limit(float voltage) {
    float clamped = voltage;
    if(clamped < FURI_HAL_POWER_CHARGE_LIMIT_MIN_V) {
        clamped = FURI_HAL_POWER_CHARGE_LIMIT_MIN_V;
    } else if(clamped > FURI_HAL_POWER_CHARGE_LIMIT_MAX_V) {
        clamped = FURI_HAL_POWER_CHARGE_LIMIT_MAX_V;
    }

    const float steps =
        floorf((clamped - FURI_HAL_POWER_CHARGE_LIMIT_MIN_V) / FURI_HAL_POWER_CHARGE_LIMIT_STEP_V);
    return FURI_HAL_POWER_CHARGE_LIMIT_MIN_V + steps * FURI_HAL_POWER_CHARGE_LIMIT_STEP_V;
}

static uint8_t furi_hal_power_voltage_to_pct(float voltage) {
    if(voltage <= furi_hal_power_curve[0].voltage) {
        return furi_hal_power_curve[0].pct;
    }

    for(size_t i = 1; i < COUNT_OF(furi_hal_power_curve); i++) {
        const FuriHalPowerCurvePoint* previous = &furi_hal_power_curve[i - 1];
        const FuriHalPowerCurvePoint* current = &furi_hal_power_curve[i];
        if(voltage <= current->voltage) {
            const float range = current->voltage - previous->voltage;
            if(range <= 0.0f) {
                return current->pct;
            }

            const float factor = (voltage - previous->voltage) / range;
            return (uint8_t)lroundf(previous->pct + factor * (current->pct - previous->pct));
        }
    }

    return 100;
}

static void furi_hal_power_ensure_initialized(void) {
    if(furi_hal_power.init_attempted) {
        return;
    }

    furi_hal_power.init_attempted = true;
    furi_hal_power.charge_voltage_limit =
        furi_hal_power_quantize_charge_limit(FURI_HAL_POWER_FULL_BATTERY_VOLTAGE_V);

    adc_unit_t adc_unit = ADC_UNIT_1;
    adc_channel_t adc_channel = ADC_CHANNEL_0;
    const esp_err_t map_result =
        adc_oneshot_io_to_channel(gpio_battery_sense.pin, &adc_unit, &adc_channel);
    if(map_result != ESP_OK) {
        ESP_LOGW(TAG, "Unable to map BAT_ADC GPIO%u: %s", gpio_battery_sense.pin, esp_err_to_name(map_result));
        return;
    }

    const adc_oneshot_unit_init_cfg_t init_config = {
        .unit_id = adc_unit,
        .ulp_mode = ADC_ULP_MODE_DISABLE,
    };

    const esp_err_t unit_result =
        adc_oneshot_new_unit(&init_config, &furi_hal_power.adc_handle);
    if(unit_result != ESP_OK) {
        ESP_LOGW(TAG, "Unable to initialize ADC unit: %s", esp_err_to_name(unit_result));
        return;
    }

    const adc_oneshot_chan_cfg_t channel_config = {
        .atten = ADC_ATTEN_DB_12,
        .bitwidth = ADC_BITWIDTH_DEFAULT,
    };

