Adam-neeeds-help/Flipper-Zero-ESP32-Port-1/components/furi_hal/furi_hal_power.c
    const esp_err_t channel_result =
        adc_oneshot_config_channel(furi_hal_power.adc_handle, adc_channel, &channel_config);
    if(channel_result != ESP_OK) {
        ESP_LOGW(TAG, "Unable to configure BAT_ADC channel: %s", esp_err_to_name(channel_result));
        return;
    }

    furi_hal_power.adc_unit = adc_unit;
    furi_hal_power.adc_channel = adc_channel;
    furi_hal_power.adc_ready = true;
    furi_hal_power.adc_cali_ready = furi_hal_power_adc_calibration_init(
        adc_unit, adc_channel, channel_config.atten, &furi_hal_power.adc_cali_handle);
    furi_hal_power.initialized = true;
}

static bool furi_hal_power_is_usb_present(void) {
    return furi_hal_power.last_supply_voltage >= FURI_HAL_POWER_USB_PRESENT_THRESHOLD_V;
}

static void furi_hal_power_refresh_sample(void) {
    furi_hal_power_ensure_initialized();
    if(!furi_hal_power.adc_ready) {
        furi_hal_power.last_sample_ok = false;
        return;
    }

    const int64_t now = esp_timer_get_time();
    if((now - furi_hal_power.last_sample_us) < FURI_HAL_POWER_SAMPLE_REFRESH_US &&
       furi_hal_power.last_sample_ok) {
        return;
    }

    int raw_value = 0;
    if(adc_oneshot_read(furi_hal_power.adc_handle, furi_hal_power.adc_channel, &raw_value) != ESP_OK) {
        furi_hal_power.last_sample_ok = false;
        return;
    }

    int pin_mv = 0;
    if(furi_hal_power.adc_cali_ready) {
        if(adc_cali_raw_to_voltage(furi_hal_power.adc_cali_handle, raw_value, &pin_mv) != ESP_OK) {
            furi_hal_power.last_sample_ok = false;
            return;
        }
    } else {
        pin_mv = (raw_value * 3300) / 4095;
    }

    float supply_voltage = ((float)pin_mv / 1000.0f) * FURI_HAL_POWER_ADC_DIVIDER_RATIO;
    if(supply_voltage < 0.0f) {
        supply_voltage = 0.0f;
    } else if(supply_voltage > 6.0f) {
        supply_voltage = 6.0f;
    }

    furi_hal_power.last_supply_voltage = supply_voltage;
    if(!furi_hal_power_is_usb_present()) {
        furi_hal_power.has_battery_reading = true;
        if(supply_voltage < FURI_HAL_POWER_EMPTY_BATTERY_VOLTAGE_V) {
            furi_hal_power.last_battery_voltage = FURI_HAL_POWER_EMPTY_BATTERY_VOLTAGE_V;
        } else if(supply_voltage > furi_hal_power.charge_voltage_limit) {
            furi_hal_power.last_battery_voltage = furi_hal_power.charge_voltage_limit;
        } else {
            furi_hal_power.last_battery_voltage = supply_voltage;
        }
    }

    furi_hal_power.last_sample_us = now;
    furi_hal_power.last_sample_ok = true;
}

static float furi_hal_power_get_estimated_battery_voltage(void) {
    furi_hal_power_refresh_sample();

    if(!furi_hal_power.last_sample_ok) {
        return 0.0f;
    }

    if(furi_hal_power_is_usb_present()) {
        return furi_hal_power.last_battery_voltage;
    }

    return furi_hal_power.last_supply_voltage;
}

void furi_hal_power_init(void) {
    furi_hal_power_ensure_initialized();

#if CONFIG_PM_ENABLE
    /* Dynamic frequency scaling: let the CPU idle at 80 MHz and ramp to 160 MHz
     * only while a peripheral driver (SPI / RMT / I2C ...) or a timing-critical
     * section (insomnia) needs it. This roughly halves idle CPU draw, which is
     * the dominant battery sink on this port. Nothing ever lowered the fixed
     * 160 MHz clock before.
     *
     * Automatic light sleep is deliberately left OFF: the input service polls
     * the encoder and buttons every 4 ms with GPIO interrupts disabled, so there
     * is no wake source and stopping the CPU would drop key presses. DFS never
     * stops the CPU, so it is safe with the polled input. SubGHz is unaffected:
     * RX is GDO0-interrupt driven and times pulses with esp_timer (XTAL-based,
     * frequency-independent), TX uses the RMT peripheral, and the IDF SPI/RMT
     * drivers hold their own PM locks during transfers. min_freq is 80 rather
     * than 40 because 80 MHz is still PLL-sourced on the S3, which keeps APB at
     * a constant 80 MHz -- so the LEDC backlight PWM and I2C timing never
     * shift. Dropping to 40 (XTAL) would halve APB and glitch them. */
    esp_pm_config_t pm_config = {
        .max_freq_mhz = 160,
        .min_freq_mhz = 80,
        .light_sleep_enable = false,
    };
    esp_err_t pm_err = esp_pm_configure(&pm_config);
    if(pm_err != ESP_OK) {
        ESP_LOGW(TAG, "esp_pm_configure failed: %s", esp_err_to_name(pm_err));
    } else {
        esp_err_t lock_err = esp_pm_lock_create(
            ESP_PM_CPU_FREQ_MAX, 0, "insomnia", &furi_hal_power_freq_lock);
        if(lock_err != ESP_OK) {
            ESP_LOGW(TAG, "esp_pm_lock_create failed: %s", esp_err_to_name(lock_err));
            furi_hal_power_freq_lock = NULL;
        } else {
            ESP_LOGI(TAG, "DFS enabled: 80-160 MHz");
        }
    }
#endif

    /* Initialize shared I2C bus for power ICs (BQ27220 + BQ25896) */
#if defined(BOARD_PIN_QWIIC_SDA) && defined(BOARD_PIN_QWIIC_SCL)
    {
        i2c_config_t conf = {
            .mode = I2C_MODE_MASTER,
            .sda_io_num = BOARD_PIN_QWIIC_SDA,
            .scl_io_num = BOARD_PIN_QWIIC_SCL,
            .sda_pullup_en = GPIO_PULLUP_ENABLE,
            .scl_pullup_en = GPIO_PULLUP_ENABLE,
            .master.clk_speed = 100000,
        };
        i2c_param_config(I2C_NUM_0, &conf);
        esp_err_t i2c_err = i2c_driver_install(I2C_NUM_0, I2C_MODE_MASTER, 0, 0, 0);
        if(i2c_err != ESP_OK && i2c_err != ESP_ERR_INVALID_STATE) {
            ESP_LOGW(TAG, "Power I2C bus init failed: %s", esp_err_to_name(i2c_err));
        }
    }
#endif

    /* Allow power ICs to stabilize after PWR_EN and I2C bus init */
    vTaskDelay(pdMS_TO_TICKS(50));

    /* BQ27220 first (needs clean I2C bus), then BQ25896 */
    furi_hal_bq27220_init();
    furi_hal_bq25896_init();
    furi_hal_power_refresh_sample();
    if(furi_hal_bq27220_is_present()) {
        ESP_LOGI(TAG, "Fuel gauge: BQ27220 (%umV, %u%%)",
            furi_hal_bq27220_get_voltage_mv(), furi_hal_bq27220_get_charge_pct());
    }
    if(furi_hal_bq25896_is_present()) {
        ESP_LOGI(TAG, "Charger: BQ25896 (VBUS=%umV, VREG=%umV)",
            furi_hal_bq25896_get_vbus_voltage_mv(), furi_hal_bq25896_get_vreg_voltage_mv());
    }
}

bool furi_hal_power_gauge_is_ok(void) {
    if(furi_hal_bq27220_is_present()) return true;
    if(!furi_hal_power.adc_handle) return true;
    furi_hal_power_refresh_sample();
    return furi_hal_power.last_sample_ok;
}

